# 1) for loop ის მეშვეობით დაბეჭდეთ როცხვები 1 დან 10 ის ჩათვლით 
for i in range(1,10):
    print(i)
# 2) for loop ის მეშვეობით დაბეჭდეთ თქვენი სახელი 100 ჯერ 
name = "saba"

for i in range(100):
    print(name)

# 3) შექმენით ცვლადი სადაც შეინახავთ საკუთარ სახელს for loop ის მეშვეობით გადაურეთ თქვენს
#  ცვლადს და გამოიტანეთ თქვენს სახელში მყოფი ყველა ასო 
for i in name:
    print(i)

# 4) for loop ის მეშვეობით შექმენით 0 დან 20 მდე რიცხვების ნაკადი და გამოიტანეთ ყოველი მეორე რიცხვი
for i in range(0,20,2):
    print(i)


# 5) ახსენით როგორ იწერება და გამოიყენება for loopი დეტალურად
# for loop გამოიყენება რომ რაღაცა გაიმეორო,მაგალითად თუ უნდა დაწერო რამე ბევრძერ უფრო იოლი და უსაფრთხო არის რომ ფორ ლოოპ გამოიღენო
# რომ შეცდომა არ დაუშვა

# 6) for loop ის მეშვეობით დაბეჭდეთ 0 დან 20 მდე რიცხვები და გამოიტანეთ მხოლოდ ლუწი რიცხვები ტერმინალში
for i in range(0,20,2):
    print(i)

# 7) for loop-ის მეშვეობით დაბეჭდეთ 75-დან 150-მდე ყველა კენტი რიცხვი
for i in range(75,150,2):
    print(i)

# 8)მომხმარებელს შემოატანინეთ ორი რიცხვი (start და stop) შემდეგ For ციკლში შექმენით რიცხვების დიაპაზონი startდან stopმდე
start = int(input("number"))
stop = int(input("number"))
for i in range(start,stop):
    print(i)

# 9) შექმენით ცხვლადი სადაც შეინახავთ ერთ დიდ რიცხვს სტრინგის სახით, მაგ: "76559875466" შემდეგ გადაუარეთ
#  for ციკლით და შეამოწმეთ მისი თითოეული რიცხვი ციფრი მეტია თუ არა 4ზე
for i in range(1264672198):
    print(i > 4)
