# 1) კომენტარის სახით ახსენით რას აკეთებს % ოპერატორი
# %-ის მეშვეობით შეგიძლია ნახო ერთი ნომერი რამდენჯერ ჩაეტევა მეორე ნომერში მაგ: 21 # 2 = 10

# 2) for loop_ის გამოყენებით გამოიტანეთ ყველა კენტი რიცხვი 100-დან 200-მდე

for i in range(101,200,2):
    print(i)

# 3) მომხმარებელს შემოატანინეთ რიცხვი, თუ ეს რიცხვი ლუწია გამოიტანეთ: even თუ კენტია: odd

number = int(input('enter a number '))
if (number % 2 == 0 ):
    print('even')
else:
    print('odd')

#4) while loop_ს გამოყენებით გამოიტანეთ ყველა კენტი რიცხვი 10 დან 20მდე

num = 11
while num < 20:
    print(num)
    num = num + 2