// 1) კომენტარებით დეტალურად ახსენით თუ რაში შეგვიძლია გამოვიყენოთ forEach და რა არის თვითონ forEach მეთოდი, რა გადაეცემა პარამეტრად და ასშ ძალიან დეტალურად უნდა ახსნათ!!!
// foreach-ის მეშვეობიტ შეგიძლია ერრეიში გამოიტანო ელემენტების სახელები,ინდექსი და ბოლოს მთელი ერრეი

// 2) forEach ის დახმარებით გადაუარეთ რაიმე მასივს და გამოიტანეთ ყველა ელემენტი და ასევე მათი ინდექსი ერთ ხაზზე

let fruits = ('ვაშლი','ბანანი','ატამი','ყურძენი')

fruits.forEach(fruit,index => {
    console.log(fruit,index)
});


// 3) forEach ით გადაურეთ numbers = [10 , -4, 6, -12, 5, -9, 23] და დაითვალეთ დადებითი რიცხვების ჯამი და უარყოფითი რიცხვების რაოდენობა და გამოიტანეთ კონსოლში


// 4) forEach ით გადაურეთ registered_users = ["nika", "zvio", "tamila", "noe", "dimitri" ,"nino"]-მასივს და შეამოწმეთ თითო user-ი თუ მათი სახელი იწყება "n"-ით დაამატეთ იგი res = [] ცვლადში და საბოლოოდ გამოიტანეთ ეს მასვიცი