// 1) შექმენი სია სადაც გექნება 5 ელემენტი შემდეგ გამოიტანე 3 ინდექსე მდგომი ელემტი
const list1 = [1,2,3,4,5]

console.log(list1[3])

// 2) შექმნი სია შემდეგ შეხვალე სიის 3 ინდექსი "Group 67" ით

let list2 = [1,2,3,4,5,6]

list2[3] = "Group 67"

// 3) შექმენი სია და პირველ ელემენტად დაამატე "summer"

let list3 = [1,2,3,4]

list3[0] = 'summer'

// 4) შექმენი სია და შემდეგ ამოჭერით 1 ინდექსიდან მარჯვნივ 3 ელემენტი

let list4 = [1,2,3,4,5,6,7,8,9]

list4.splice(1,4)

// 5) შექმენი Nested array სადაც გექნება რამდენიმე ელემენტი და გამოიტანე სიაში მოცემული სიის პირველი ინდექსი


let list5 = [
    [1,2,3],
    ['hello','bye'],
    [1.3,14.5]
]

console.log(list5[1][0])