# 1)ახსენით კომენტარებით რა არის tuple და რით განსხვავდება სიისგან
# tuple ჰგავს სიას იმით რომ რამოდენიმო სხვა რამეს ინახავს მაგრამ სიისგან განსხვავებით მისი გარედან შეცვლა არ შეიძლება და კიიდა ოთხკუთხედი გრჩხილების მაგივრად  ჩვეულებრივებით იწერება

# 2)შექმენი Tuple სადაც გექნება შენახული ადამიანის სახელები, შემდეგ გამოიტანე პირველი და ბოლო ელემენტის გარდა ყველა ელემენტი, სცადე slicing ის გამოყენება

names = ('saba','luka','gega','zura')

print(names[1:-1])

# 3) კომენტარებით ახსენით tuple ს თითოეული მეთოდი რაომელი რას აკეთებს
# tuple-ს აქვს index() და count().index()-ი გამოიყენება რომ რაიმეს ინდექსი იპოვო. count() გამოუიყენაბება რომ ვნახოთ რამდენჯერ მეორდება რამე


# 4) კომენტარებით ახსენით დეტალურად ყველაფერი რასაც დაწერთ (კოდი ახსენით)

# მეორეში tuple შევქმნი და slicing-ით ყვეფერი დავბეჭდე პირველის და ბოლოს გარდა

# 5)კომენტარებით ახსენით რა არის unpacking და მოიყვანეთ unpacking ზე 5 მაგალითი 

# unpacking არის სიაში ყველაფერს რაიმე ცვლადის მინიჭება

hello = (1,2,3,4)

n1,n2,n3,n4 = hello

bye = ('hello',True,'ball')

w1,b1,w2 = bye