// 1)მოიყვანეთ 2 მაგალითი string literal - ზე

const idk = 'hello'
const idk1 = 'the world'

console.log(idk)
console.log(idk1)

// 2)ახსენით რა განსხვავებაა ++  და += -ს შორის მოიყვანეთ თითო მაგალითი

// ++ მეშვეობით შეგიძლიათ რამეს დაუმატოთ 1 თუ წინ დაჭერ ++-ს ჯერ რიცხვს დაწერს და მერე მიუმატებს,თუ ++-ს დაწერ პირველს ჯერ მიუმატებს
const number1 = 3
console.log(number1++)

// += -ით შეგიძლია მიუმატო რამეს სხვა რამე და მიღებული შედეგი შეინახო

console.log(number1+= 1)


// 3)რამდენი გზა გვაქ ცვლადის შექმნის და რა განსხვავებაა თითოეულს შორის

// შეგვიძლია ცვლადი შევქნათ 3 სხვა და სხვა გზით,თუ პირველი ორი გზით გააკეთებ (let,var) მერე შეგიძლია შეცვალო და const-ით შეცვლა არ შეიძლება

// 4)შექმენი ცვლადი სადაც შეინახავ ნებისმიერ მთელ რიცხვს თუ ეს რიცხვი არის 0 ზე მეტი კონსოლში გამოიტანე Positive თუ რიცხვი არის 0 ზე ნაკლები გამოიტანე Negative და თუ რიცხვი არის 0 გამოიტანე Zero

const number2 = 2

if (number2 > 0){
    console.log('positive')
}else if(number2 < 0){
    console.log('negative')
}else{
    console.log('zero')
}


// 5)შექმენი ცვლადი სადანც შეინახავ რიცხვს(0-100) თუ ეს რიცხვი იქნება 90 დან 100-ჩათვლით კონსოლში გამოიტანე "A" თუ რიცხვი არის 70 დან 89-ჩათვლით გამოიტანე "B" თუ რიცხვი არის 50 დან 69-ჩათვლით გამოიტანე "C" სხვა შემთხვევაში გამოიტანეთ "F"

const number3 =74

if (number3 > 90 && number3 < 100){
    console.log('A')
}else if(number3 > 70 && number3 < 90){
    console.log('B')
}else if(number3 > 60 && number3 < 70){
    console.log('C')
}else{
    console.log('F')
}
