# 1)კომენტარის სახით ახსენით რა არის list და რაში ვიყენებთ მას.
# list  არის ცვლადი რომელშიც შეგვიძლია ბევრი სხვა მონაცემი ჩავდოთ. არ აქვს მნიშვნელობა თუ int float string ან boolean არის შეგიძლია ერთ list ში ჩადო


# 2)შექმენით სია რომელსაც ექნება 10 ელემენტი და შემდეგ ტერმინალში გამოიტანეთ ამ სიის პირველი და ბოლო ელემენტები.

list = ['milk','eggs','bread','fruit']
print(list[0])
print(list[-1])


# 3)შექმენით სია 5 ელემენტით, შემდეგ მომხმარებელს შემოატანინეთ რაიმე მონაცემი რომელსაც ჩაამატებთ თქვენს მიერ შექმნილ სიაში.

list1 = [1,2,3,4,5]
list1 = [1,2,3,4,5,input('type something ')]
print(list1)

# 4)შექმენით სია 5 ელემენტით და შემდეგ გამოიტანეთ მე-3 და მე-4 ინდექსზე მყოფი ელემენტები.

list_1 = [1,2,3,4,5]
print(list_1[2])
print(list_1[3])


# 5)for loop-ის დახმარებით გამოიტანეთ ყველა კენტი რიცხვი 10 დან 100მდე.

for i in range(9,100,2):
    print(i)

# 6)შექმენით სია 5 სახელის ელემენტით, მომხმარებელს შემოატანინეთ რიცხვი 0 დან 4 ჩათვლით (თუ ამ დიაპაზონში შემოიტანს მომხმარებელი რიცხვს, მაშინ გამოუტანეთ სიაში იმ ინდექსზე მდგონი ელემენტი, სხვა შემთხვევაში დაუბეჭდეთ "Number out of Range!"

List = [1,2,3,4,5]
number = int(input('type a number 0-4 '))
if number > 4:
    print('error')
print(List[number])

