# 1)შექმენით dictionary სადაც შენახული იქნება შენი სახელი, ასაკი და ქალაქი.

# შემდეგ ამოიღეთ კონკრეტული მნიშვნელობა და შეინახე ცვლადში.

# ასევე შეცვალეთ რომელიმე მნიშვნელობა რაც გექნება dictionary ში.

# წაშალე ერთი ელემენტი.

# ასევე გამოიტანეთ მხოლოდ value ები


# ახსენით თითოეული მეთოდი კომენტარებით თუ რას აკეთებს.


user = {
    'name': 'saba',
    'age': 15,
    'city': 'tbilisi',
}


my_name = user.get('name')
# კონკრეტულ key-დან იღებს მნიშვნელობას
user.update({'height': 172})
# ცვლის ან ამატებს რამეს
user.pop('age')
# რამეს შლის


print(list(user.values()))
# მხოლოდ მნიშვნელობები გამოყავს