# 1) კომენტარეის სახით ახსენით რას ნიშნავს immutable და mutable.
# mutable არის მონაცემი რომლის წევრი შეიძლება შეცვალო გარედან, მაგალითად list არის mutable.
# immutable არის მონაცემი რომლის წევრის გარედან შეცვლა არ შეიძლება, მაგალითად string.


# 2) შექმენით სია 20 ელემენტით და შემდგომ მეათე და მეჩვიდმეტე ელემენტები ჩაანაცვლეთ რაიმე რიცხვებით. (გამოიყენეთ უარყოფითი ინდექსები).

number = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]

number[-11]=31

number[-4]=45

print(number)

# 3) ცვლადში შეინახეთ რაიმე სტრინგი და შემდგომ ინდექსინგით შეუცვალეთ მესამე და მეხუთე ადგილზე მყოფი ასოები.

# ეგ შეუძლებელია რადგან string არის immutable.



# 4) ცვლადში შეინახეთ რაიმე password შემდეგ მომხმარებელს იქამდე შემოაყვანინეთ  პაროლი სანამ არ დაემთხვევა ნამდვილ პაროლს, და საბოლოოდ როცა სწორად შეიყვანს გამოუტანეთ: "თქვენ წარმატებით ჩაწერეთ პაროლი".

password = 123321

password1 = int(input('type a six number passsword '))
 

while password != password1:
    print('wrong password')
    password1 = int(input('type a six number passsword '))

print('you guessed the password')

# 5) while loop-ის დახმარებით გამოიტანეთ ყველა ლუწი რიცხვი 40 დან 10მდე.

num = 40

while (num != 10):
    print(num)
    num = num - 2
