// 1) თქვენი სიტყვებით ახსენით რა არის scope ები


// scope არის რაიმე ცვლადის მუშაობის ადგილები.ზოგი ცვლადი ყველგან მუშაობს და ზოგი მხოლოდ ერთ ფუნქციაში

// 2) კომენტარებით ახსენით როგორ მუშაობს ყველა scope


// scope-ის დანიშნულება არის რომ კოდში რაიმე ფართობზე იმუშავოს,თუ რაიმე ცვლადი ფუნქციის გარეთ დაიწერებს მას შეუძლია მთელ კოდის მაშტაბსში
//  გამოიყენო ტყ ფუნქციაში შექმნი მხოლოდ ფუნქციაში შეიძლება გამოყენება


// 3) თითოეულ scope-ze მოივანე თითო მაგალითი
// global scope
const globalscope = 'hello how are you'

// function scope

function demo(){
    var funcscope = 'hello'
}

// block scope

function demo2(){
    let blockscope = 'hi'
}