# 1) კომენტარით ახსენით როგორ მუშაობს ინდექსინგი.
# ინდეხინგი გამოიყენება როდესაც სიიდან გინდა გამოიძახო რაიმე მონაცემი.რომ ეს გააკეთო უნდა შექმნა სია და დაწერო print('სიის სახელი'['მონაცემის ჩაწერის ნომერი'])
# პირველი მონაცემი სიაში ითვვლება როგორც 0 ნომერი და დანარჩენი ნორმალურად ითვლება

# 2) შექმენით სია 10 ელემენტით და გამოიტანეთ ბოლო და ბოლოსწინა ელემენტები.
list = [1,2,3,4,5,6,7,8,9,10]
print(list[-1])
print(list[-2])

# # 3) მომხმარებელს შემოატანინეთ რიცხვი 0დან 10მდე, შემდეგ შექმენით სია 11 ელემენტით, თუ შემოტანილი რიცხვი ამ დიაპაზონში იქნება მაშინ, გამოიყენეთ ეს რიცხვი როგორც ინდექსი, და ამ ინდექსზე მყოფი ელემენტი დააupdateთ რაიმე სხვა მონაცემით.

num1 = int(input('enter a number from 0 to 10(including 10):'))
lst = ['Lopsided','Crinkle','Mirth','Splotch','Glimmer','Whimsy','Plunk','Tangle''Nuzzle','Quiver','bow']
if num1 < 11:
     print(lst[num1])

# 4) შექმენით სია 5 ელემენტით, შემდეგ მას გადაუარეთ for loopით და გამოიტანეთ ყველა სიაში მყოფი ელემენტი (როგორც გაკვეთილზე გავაკეთეთ).

list1 = ['burger','fries','pizza','cake','pie']
for i in list1:
     print(i)


# 5) შექმენით სია 8 ელემენტით და მე3 და მე7 ელემენტები შეცვალეთ სიის გარედან, (upadte-ით)

list2 = [0,1,2,3,4,5,6,7]
list2[2] = list2[6]
list2[6] = 2
print(list2)