#1)შექმენით სია რომელშიც იქნება 5 სახელი შემდეგ, ამოიღეთ სიიდან პირველი და ბოლო ელემენტი
list = ['saba','gio','luka','gega','ivi',]
list.pop(0)
list.pop(3)

#2)კომეტარებით ახსენით რას აკეთებს თითოეული ფუნქცია:
#.insert()
#.append()
#.pop()
#.len()

# .insert()-ის ფუნქცია არის რომ რაიმე სიაში რაიმე ელემენტის ადგილას სხვა ელემენდი დადო
# .append-ის ფუქცია არის გამოყენებული რომ რაიმე სიის ბოლოს მიუმატო რამე
# .pop() გამოიყენება რომ რაიმე სიიდან წაშალო ელემენტი
# .len გამოიყენება რომ რაიმეს სიგრზე ვნახოთ,მაგალითად რამდენი ასოა სტრინგში ან რამდენი ელემენტი სიაში

#3) შექმენით სია რომელიც შედგება 5 სახელისგან შემდეგ insert მეთოდით დაამატეთ ახალი სახელი სიის მეორე ინდექსზე
list2 = ['saba','emir','luka','gega','ivi',]
list2.insert(2,'dachi')

#4)კომენტარის მეშვეობით ახსენით .lower() / .upper() / .capitalize() / .find() ფუნქციების დანიშნულება
#.lower() რომ ყველა ასო დააპატარავო სტრინგში
#.upper() რომ ყველა ასო გაადიდო სტრინგში
#.capitalize() რომ პირველი ასო გაადიდოს და დანარჩენი დააპატარავოს
#.find() რომ რაიმე ასოს ადგილი იპოვოს

#5)მომხმარებელს შემოატანინეთ მისი გვარი და შეამოწმეთ, თუ გვარის პირველი ასო არის დიდი ასო, მაშინ დაუბეჭდეთ "Hello", თუ არ არის მაშინ დაუბეჭდეთ "Bye"
NAME = input('enter your name:')
NAME2 = NAME.capitalize()
if NAME == NAME2:
    print('hello')
else:
    print('bye')

#6)მომხმარებელს შემოატანინეთ სახელი, შემდეგ შემოატანინეთ ასო და თუ ამ სახელში ეს ასო არიქნება, მაშინ გამოუტანეთ "Can't find character", თუ იქნება მაშინ გამოუტანეთ "found it" და გვერდზე მიუწერეთ ამ ასოს ინდექსი

name = input('enter your name:')
letter = input('enter a letter in your name:')

name2 = name.find(letter)
print(name2)

#7)მომხმარებელს შემოატანინეთ მისი გვარი, შემდეგ შეეკითხეთ როგორ უნდა რო შეიცვალოს მისი გვარის ასოები, თუ გიპასუხებთ "upper" გადაიყვანეთ მთლიანი გვარი დიდ ასოებად, თუ გიპასუხებთ "lower" გადაიყვანეთ მთლიანი გვარი პატარა ასოებად და თუ გიპასუხებთ "capitalize" გადაიყვანეთ გვარის მხოლოდ პირველი ასო დიდ ასოდ.

surname = input('enter your surname')
prefrence = input('do you want your surname:uppercase(upper),lowercase(lower),capitilized(capitalize):type the option in brackets:')
if prefrence == 'upper':
    print(surname.upper())
elif prefrence == 'lower':
    print(prefrence.lower())
elif prefrence == 'capitalize':
    print(prefrence.capitalize())
else:
    print('error')

#8)შექმენით სია შემდგარი 10 ელემენტისგან, და გამოიტანეთ მხოლოდ კენტ ინდექსზე მდგომი ელემენტი
dark = [1,2,3,4,5,6,7,8,9,10]
dark2 = dark[1::2]

#9)შექმენით სია რომელიც შედგება 5 რიცხვისგან, გადაუარეთ ამ სიას for ციკლით და შეაჯამეთ თითოეული რიცხვი, ბოლოს გამოიტანეთ ამ რიცხვების ჯამი (დაგჭირდებათ ერთი დამატებითი დამთვლელი ცვლადი (ჯამის ცვლადი, რომელსაც თითოეული რიცხვი დაემატება ყოველ იტერაციაზე))

numbers = [1,2,3,4,5]
for i in numbers:
    print(i)
    numbers2 = 0 + i
#10)შექმენით სია შემდგარი 10 რიცხვისგან, გადაურეთ for ციკლით, შეამოწმეთ კენტია თუ ლუწი, თუ ლუწია დაბეჭდეთ i, "luwia", თუ კენტია i, "kentia"
list6 = [1,2,3,4,5,6,7,8,9,10]
for i in list6:
    print(i)
    if i % 2 == 0:
        print("luwia")
    else:
        print("kentia")
#11)კომენტარის სახით ახსენით როგორ იქმნება ფუნქციები (ისაუბრეთ არგუმენტებზე, პარამეტრებზე, def-ზე და return-ზე) ასევე ახსენით რა განსხვავებაა print-სა და return-ს შორის

# ფუნქცია იწყება def ით, მას უნდა მიუწერო პარამეტრი რომ მერე არგუმენტი მიუწერო,კიდევ როცა დაამთავრებ უნდა მიუჭერო return-i. print-ში და return-ში განსხვავება არის რომ return mxolod def-ში იწერება

#12)შექმენით ფუნქცია სახელად sum, რომელსაც გადაეცემა რიცხვების სია და თქვენი დავალებაა დაბეჭდოთ ამ სიაში მყოფი ყველა რიცხვის ჯამი

