// 1)რა იქნება ამ კოდის შედეგი

// 2) კომენტარებით ახსენით რა არის მასივი და რისთვის ვიყენებთ

// 3) შექმენით მასივი სადაც შეინახავთ სახელებს შემდეგ გამოიდანე სიის 3 ინდექსი

// 4) შექმენით მასივი სადაც შეინახავთ 5 ელემენტს შემდეგ გამოიყენეთ ფუნქცია რომელიც გამოიტანს სიის სიგრძეს

// 5) შექმენით მასივი და ბოლოში ჩაამათე ელემენტი და საბოლოოდ დააკონსოლოგე მასივი

// 6) კომენტარებით ახსენით რა განსხვავებაა pop და shift მეთოდებს შორის მოიყვანეთ მათზე თითო მაგალითი

// 7) შექმენი სია სადაც იქნება 4 ელემენტი და ამოჭერით პირველი 2

// 8) შექმენით ორი სია შემდეგ გააერთიანეთ იგი და გამოიტანეთ საბოლოო შედეგი

// 9) რას გამოიტანს ეს კოდი და რატომ

// const classroom = [
//   ["Alice", "Bob", "Charlie"],   
//   ["David", "Eva", "Frank"],     
//   ["Grace", "Henry", "Ivy"]      
// ]
// console.log(classroom[1][1])


// 1) vANOhello

// 2) მასივი არის ბევრი ელემენტების ერთ ცვლადში მოთავსება, ეს საჭიროა რომ ბევრი ტიპის ინფორმაცია შვინახოთ

// 3)

const names = ['saba','luka','giorgi','shota']
console.log(names[3])

// 4) შექმენით მასივი სადაც შეინახავთ 5 ელემენტს შემდეგ გამოიყენეთ ფუნქცია რომელიც გამოიტანს სიის სიგრძეს

const names2 = ['saba','luka','giorgi','shota','ivi']

console.log(names2.length)


// 5)

const names3 = ['saba','luka','giorgi','shota','ivi','nika']

console.log(names3.push('hello'))

// 6)

// pop დასაწყისიდან აკლებს shift ბოლოდან

console.log(names3.shift())
console.log(names3.pop())

// 7)

console.log(names3.slice(0,2))

// 8)

console.log(names2.concat(names3))

// 9) გამოიტანს "Eva"-ს 