#1) შექმენით ცვლადები სხვადასხვა ტიპით: str,int,float,bool შემდეგ  დაბეჭდეთ მათ მნიშნელობა და გვერდით მიუწერეთ მონაცემთა ტიპი
print('saba')  # this is a string
print(5)  # this is s integer
print(True)   # this is a boolean
print(2.0)  # this is a float
#2) ჰკითხე მომხარებელს სახელი,ასაკი და საყვარელი რიცხვი, დაბეჭდე თითოეული მნიშვნელობა და მისი ტიპი (type() ფუნქციით) შედეგ ასაკი და საყვარელი რიცხვი გადააქციე რიცხვებად (int() ან float()) და დაბეეჭდეთ მათი ჯამი.
name = input('enter name: ')
age = int(input('age: '))
number = int(input('favorite number: '))
print(name)
print(age)
print(number)
print(type(name))
print(type(age))
print(type(number))
print(age + number)
# 3) შექმენი რიცხვების დიაპაზონი 5 დან 100მდე შემდეგ გამოიტანეთ ეს რიცხვები ასეთი თანმიმდევრობით:
#რიცხვი, გვერდით მიუწერე კენტია თუ ლუწი და მიუწერე მისი მონაცემთა ტიპი
for i in range(5,100):
    print(i)
    if i % 2 == 0:
        print('this number is even')
    else:
        print('this number is odd')

# 4) კომენტარის სახით ახსენით რაში გამოიყენება ფუნქციები, ასევე ჩამოთვალეთ ნასწავლი ფუნქციები და გვერდით მიუწერეთ მათი დანიშნულება
# ფუნქცია არის რაიმე კოდი რომელიც რამდენჯერაც გინდა გაიმეორო:
# ესენია print,int,str,int,range,input

# 5) კომენტარის სახით ახსენით რა არის ფუნქციის არგუმენტი
# არგუმენტი არის ფუნქციის შემავალი ნივთი,არგუმენტები ერთმანეთისგან დაშორდება მძიმით

