#2) მომხმარებელს შემოატანინეთ სიტყვა, შემდეგ if-ით შეამოწმეთ ეს სიტყვა თუ თავისი თავის ტოლია როდესაც შემოაბრუნებთ (slicing-ის დახმარებით), თუ ასეა დაბეჭდეთ რომ განსაკუთრებული (ასეთ სიტყვებს palindrome ჰქვია) სიტყვაა, სხვა შემთხვევაში კი დაბეჭდეთ რომ ჩვეულებრივი სიტყვაა.


word = input("enter a word ")
if word == word[::-1]:
    print('this is a palindrome')
else:
    print('this is a normal word')


# 3) შექმენით სიტყვების სია, შემდეგ მის შემობრუნებულ ვერსიას გადაუარეთ for ციკლით, დაბეჭდეთ ყოველი მეორე ელემენტი (რომ გაიგოთ ყოველი მეორე აიღეთ ცვლადი რომელიც თავიდან 0 იქნება, ყოველ გამეორებაზე კი გაზრდით ერთით და შეამოწმეთ ლუწია თუ კენტი)

list = ['car','dog','snake','solid','big','boss']

list2 = list[::-1]

for i in list2:
    print(list2[0::2])
    print(list2[1::2])
    print(list2[2::2])
    print(list2[3::2])
    print(list2[4::2])
    print(list2[5::2])
# ვერ ვხვდები თუ სწორად დავწერე


# 4) მომხმარებელს შემოატანინეთ სიტყვა და დაბეჭდეთ ის შებრუნებულად

w = input('type a word ')
print(w[::-1])

# 5) შექმენით ცვლადი რომელშიც შეინახავთ თქვენთვის სასურველ string-ს, უნდა იყოს მინიმუმ 20 სიმბოლო, შემდეგ slicing-ის საშვალებით დაბეჭდეთ ეს string ხუთგვარად შემდეგი პირობებით:
# - მხოლოდ პირველი 5 სიმბოლო
# - ბოლო 4 სიმბოლო
# - შუა ნაწილი მეოთხე სიმბოლოდან მეათემდე
# - მთელი სტრინგი შებრუნებულად
# - სტრინგი ამოჭრილი ყოველ მეორე სიმბოლოზე

string = 'abcdefghijklmnopqrst'

print(string[0:4])

print(string[-5:])

print(string[3:9])

print(string[::-1])

print(string[0::4])