 #1)ახსენით რაში ვიყენებთ ცვლადებს.

#2)ახსენით რა არის ცვლადის მნიშვნელობის განახლება და როგორ მუშაობს იგი.

#3)შექმენი ცვლადი, სადაც შეინახავ შენს ასაკს და დაბეჭდე რამდენი წლის იქნები 5 წელში.

#4)შექმენი 3 ცვლადი, პირველში შიენახეთ თქვენი ასაკი, მეოერში შეინახეთ თქვენი საყვარელი რიცხვი, ხოლო მესამე ცვლადში შეინახეთ პირველი ცვლადი გაყოფილი მეორე ცვლადზე.

#5)შექმენით ცვლადი, სადაც შეინახავთ თქვენს სახელს, შემდეგ 3-ჯერ შეიცვალეთ მას მნიშვნელობა და მიანიჭეთ სხვადასხვა  სახელები. 



# 1)ცვლადებს ვიყენებთ რომ დავიმახსოვროთ რაიმე მონაცემები

# 2) როდესაც პროგრამას იწყებ, კომპიუტერი ზევიდან ქვევით კითხულობს.თუ ცვლადს გააკეთებ და მის შემდეგ ისევ გააკეთებ ცვლადს რომელსაც ერთიდაიგივე სახელი აქვს,
#მაგრამ შეუცვლი მნიშვნელობას ყველაზე ახალ დაწერს გაითვალისწინებს პროგრამა.

# 3)
age = 14
print(age + 5)

# 4)
age = 14
number = 5
print(age / number)

# 5)
name = 'saba'
name = 'luka'
name = 'gega'