# 1)მოხმარებელს შემოატანინეთ მისი გვარი, შემდეგ შემოატრიალეთ ეს გვარი და გადაურეთ for ციკლით.

name = input('enter a name ')
new_name = name[::-1]
for i in new_name:
    print(i)


# 2)კომენტარის სახით ახსენით რაში ვიყენებთ sliceing-ს და რაში ვიყენებთ indexing-ს, ასევე დაწერეთ რა განსხვავებაა მათ შორის.
# slicing-ს ვიყენებთ რომ რაიმე list-ში ამოჭრა ელემენტები. indexing არის ელემენტის ადგილი list-ში

# 3)შექმენით 10 ელემენტიანი სია, და გამოიტენეთ ამ სიის მხოლოდ ლუწ ინდექსზე მდგომი ელემენტები (ანუ: 0,2,4,6... ინდექსები)

list = [1,2,3,4,5,6,7,8,9,10]
print(list[11:10:2])

# 4)შექმენით სია, სადაც გექნებათ 10 სახელი, მომხმარებელს შემოატანინეთ შემდეგ ორი რიცხვი (პირველი უნდა იყოს დასაწყისი წერტილი, მეორე უნდა იყოს დასასრული წერტილი), შემდეგ გამოიტანეთ ამ სიის შესაბამისი ნაწილი, მომხმარებლის რიცხვების გამოყენებით


list1 = ['saba','luka','ivi','emir','gega','gio','nika','nini','mari','elene']
num1 = int(input('enter number '))
num2 = int(input('enter number '))

print(list1[num1:num2])


# 5)შექმენით სია სადაც იქნება 15 ელემენტი, შემდეგ მომხმარებელს შემოატანინეთ ერთი რიცხვი და sliceing-ის გამოყენებით გამოიყენეთ ეს რიცხვი როგორც step (სიტყვაზე შემოიტანა რიცხვი 3, თქვენ ამ სიის ყოველი მესამე ელემენტი უნდა გამოიტანოთ)

num3 = int(input('enter number '))
list3 = [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]
print(list3[0:15:num3])


#6)მომხმარებელს შემოატანინეთ მისი გვარი, თუ გვარი სრულდება "shvili"-თ, მაშინ დაუბეჭდეთ "Hello", სხვა შემთხვევაში "Byee"

surname = input('enter surname ')
if (surname[-6:] == "shvili"):
    print("hello")
else :
    print('byee')
